title: DACL Modification of Service Control Manager via sdset
id: 8998782b-66de-44e7-8335-305e2dd431b3
status: experimental
description: This rule detects usage of sdset to modify the DACL of the service-control manager service, scmanager.
references:
    - https://twitter.com/0gtweet/status/1628720819537936386?cxt=HHwWhIC87Ze9sJotAAAA
tags:
    - attack.persistence
    - attack.privilege_escalation
author: Gabriel De Jesus (0xv1n)
date: 2023/02/28
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith:
            - '\sc.exe'
        CommandLine|contains|all:
            - ' sdset '
            - ' scmanager '
            - ' D:(A;;KA;;;WD) '
    condition: selection
fields:
    - Image
    - CommandLine
falsepositives:
    - Unknown
level: high